Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/rights_of_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Rights of cohabiting couples
ga: Na cearta atá ag lánúineacha comhchónaithe

source: Cohabitants are defined in the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 as two same-sex or opposite-sex adults who are:
ga: Sainítear comhchónaitheoirí san Acht um Páirtnéireacht Shibhialta agus um Chearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí, 2010 mar bheirt daoine fásta comhghnéis nó den ghnéas eile:

source: • Not married to each other and
ga: • Nach bhfuil pósta lena chéile, agus

source: • Not in a registered civil partnership and
ga: • Nach bhfuil i bpáirtnéireacht shibhialta chláraithe, agus

source: • Not related within the prohibited degrees of relationship (broadly speaking, relationships which would make them ineligible to marry each other) and
ga: • Nach bhfuil gaolta lena chéile laistigh de theorainneacha toirmiscthe caidrimh (is é sin go bunúsach, caidreamh nach mbeidís incháilithe chun iad féin a phósadh), agus

source: • Living together in an intimate and committed relationship
ga: • Atá ag cónaí lena chéile i gcaidreamh tiomnaithe agus dlúth

source: Cohabitants (cohabiting couples) do not possess the same legal rights and obligations as married couples or civil partnerships
ga: Níl na cearta agus na dualgais dlí chéanna ag comhchónaitheoirí (lanúineacha comhchónaithe) agus atá ag lanúineacha pósta nó ag páirtnéireachtaí sibhialta

source: Given the limited legal recognition of your relationshipship, this will obviously have some significant implications for various parts of your life
ga: Agus aird ar an aithint theoranta dhlíthiúil i leith do chaidrimh, is léir go mbeidh roinnt impleachtaí suntasacha aige seo ar chodanna ar leith de bhur saol

source: This section aims to guide you through the various issues associated with living in a cohabiting relationship in Ireland
ga: Tá sé de chuspóir, sa mhír seo, chun treoir a thabhairt duit maidir leis na saincheisteanna éagsúla a bhaineann le bheith i gcaidreamh comhchónaithe in Éirinn
